// Задача 15
Console.WriteLine("ВВедите число  дня недели");
int n = Convert.ToInt32(Console.ReadLine());
if (n > 5)
Console.WriteLine("Ура выходной!");
else 
{
  Console.WriteLine("Еще нужно потрудиться((("); 
}

//Задача 13
Console.WriteLine("ВВедите число");
int n = Convert.ToInt32(Console.ReadLine());
if (n = n / 10; n > 1000)
Console.WriteLine("n % 10");

//Задача 10
Console.WriteLine("ВВедите трехзначное число");
int n = Convert.ToInt32(Console.ReadLine());
int = result;
if (n < 100 || n > 999)
{
  Console.WriteLine(" ВВедите не техзначное число");
}
else
{
    result = (n / 10) % 10;
      Console.WriteLine(result);

}






